//
//  Font data for Wingdings 16pt
//
#include <avr/pgmspace.h>
#include <stdint.h>
#include "bitmap_db.h"

// Character bitmaps for Wingdings 16pt
const uint8_t wingdings_16ptBitmaps[]PROGMEM =
{
	// @0 '¨' (15 pixels wide)
	0x00, 0x00, //
	0xFF, 0xFE, // ###############
	0xFF, 0xFE, // ###############
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xC0, 0x06, // ##           ##
	0xFF, 0xFE, // ###############
	0xFF, 0xFE, // ###############

	// @32 'ý' (15 pixels wide)
	0x00, 0x00, //
	0xFF, 0xFE, // ###############
	0xFF, 0xFE, // ###############
	0xC0, 0x06, // ##           ##
	0xC4, 0x06, // ##   #       ##
	0xCC, 0x66, // ##  ##   ##  ##
	0xCE, 0xF6, // ##  ### #### ##
	0xC7, 0xC6, // ##   #####   ##
	0xC3, 0x86, // ##    ###    ##
	0xC7, 0xC6, // ##   #####   ##
	0xCE, 0xF6, // ##  ### #### ##
	0xDE, 0x66, // ## ####  ##  ##
	0xCC, 0x06, // ##  ##       ##
	0xC0, 0x06, // ##           ##
	0xFF, 0xFE, // ###############
	0xFF, 0xFE, // ###############

	// @64 'þ' (16 pixels wide)
	0x00, 0x01, //                #
	0xFF, 0xFE, // ###############
	0xFF, 0xFE, // ###############
	0xC0, 0x0E, // ##          ###
	0xC0, 0x16, // ##         # ##
	0xC0, 0x26, // ##        #  ##
	0xC0, 0x66, // ##       ##  ##
	0xD8, 0xC6, // ## ##   ##   ##
	0xDD, 0x86, // ## ### ##    ##
	0xCD, 0x86, // ##  ## ##    ##
	0xC7, 0x06, // ##   ###     ##
	0xC6, 0x06, // ##   ##      ##
	0xC4, 0x06, // ##   #       ##
	0xC0, 0x06, // ##           ##
	0xFF, 0xFE, // ###############
	0xFF, 0xFE, // ###############
};

// Character descriptors for Wingdings 16pt
// { [Char width in bits], [Offset into wingdings_16ptCharBitmaps in bytes] }
const FONT_CHAR_INFO wingdings_16ptDescriptors[] =
{
	{15, 0}, 		// ¨
	{0, 0}, 		// ©
	{0, 0}, 		// ª
	{0, 0}, 		// «
	{0, 0}, 		// ¬
	{0, 0}, 		// ­
	{0, 0}, 		// ®
	{0, 0}, 		// ¯
	{0, 0}, 		// °
	{0, 0}, 		// ±
	{0, 0}, 		// ²
	{0, 0}, 		// ³
	{0, 0}, 		// ´
	{0, 0}, 		// µ
	{0, 0}, 		// ¶
	{0, 0}, 		// ·
	{0, 0}, 		// ¸
	{0, 0}, 		// ¹
	{0, 0}, 		// º
	{0, 0}, 		// »
	{0, 0}, 		// ¼
	{0, 0}, 		// ½
	{0, 0}, 		// ¾
	{0, 0}, 		// ¿
	{0, 0}, 		// À
	{0, 0}, 		// Á
	{0, 0}, 		// Â
	{0, 0}, 		// Ã
	{0, 0}, 		// Ä
	{0, 0}, 		// Å
	{0, 0}, 		// Æ
	{0, 0}, 		// Ç
	{0, 0}, 		// È
	{0, 0}, 		// É
	{0, 0}, 		// Ê
	{0, 0}, 		// Ë
	{0, 0}, 		// Ì
	{0, 0}, 		// Í
	{0, 0}, 		// Î
	{0, 0}, 		// Ï
	{0, 0}, 		// Ð
	{0, 0}, 		// Ñ
	{0, 0}, 		// Ò
	{0, 0}, 		// Ó
	{0, 0}, 		// Ô
	{0, 0}, 		// Õ
	{0, 0}, 		// Ö
	{0, 0}, 		// ×
	{0, 0}, 		// Ø
	{0, 0}, 		// Ù
	{0, 0}, 		// Ú
	{0, 0}, 		// Û
	{0, 0}, 		// Ü
	{0, 0}, 		// Ý
	{0, 0}, 		// Þ
	{0, 0}, 		// ß
	{0, 0}, 		// à
	{0, 0}, 		// á
	{0, 0}, 		// â
	{0, 0}, 		// ã
	{0, 0}, 		// ä
	{0, 0}, 		// å
	{0, 0}, 		// æ
	{0, 0}, 		// ç
	{0, 0}, 		// è
	{0, 0}, 		// é
	{0, 0}, 		// ê
	{0, 0}, 		// ë
	{0, 0}, 		// ì
	{0, 0}, 		// í
	{0, 0}, 		// î
	{0, 0}, 		// ï
	{0, 0}, 		// ð
	{0, 0}, 		// ñ
	{0, 0}, 		// ò
	{0, 0}, 		// ó
	{0, 0}, 		// ô
	{0, 0}, 		// õ
	{0, 0}, 		// ö
	{0, 0}, 		// ÷
	{0, 0}, 		// ø
	{0, 0}, 		// ù
	{0, 0}, 		// ú
	{0, 0}, 		// û
	{0, 0}, 		// ü
	{15, 32}, 		// ý
	{16, 64}, 		// þ
};

// Font information for Wingdings 16pt
const FONT_INFO wingdings_16ptFontInfo =
{
	2, //  Character height
	'¨', //  Start character
	'þ', //  End character
	2, //  Width, in pixels, of space character
	wingdings_16ptDescriptors, //  Character descriptor array
	wingdings_16ptBitmaps, //  Character bitmap array
};

